#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag               = "1be2ceca41c24b1d31bc89b0ca9dac3e" -> "b691dda76e84be785555f52187d918b2"
        id                 = "lambdas/demo/add_investment_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag               = "16dfc042ec782f0a4d72e82cbce58cc4" -> "eea7a74c91f8d7f9e1276fe410f52b21"
        id                 = "lambdas/demo/add_scenario_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_tag_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_tag_function_object" {
      ~ etag               = "b7ea9969ef58cd53a7835364208bc0c3" -> "eb1f7ccab6043b570f2a9cb10b8ac41f"
        id                 = "lambdas/demo/add_tag_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag               = "8b77a1f7ad6d7c4cb05c2e4e27836f40" -> "927ffb11ef1797fab4ba0642ce1e53d2"
        id                 = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag               = "d76f9645b23236689e01c6c9c572990f" -> "ee5cc3719d079898b5298ca0b3d1c0b6"
        id                 = "lambdas/demo/assign_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag               = "40fce44b33d2c097b6032055432403ec" -> "457f74c692f860aeccedcadcf07422db"
        id                 = "lambdas/demo/authorize_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag               = "71191a0425eecc6bef1db49db322db55" -> "6e71ab5de11623a000ac1efd189643c7"
        id                 = "lambdas/demo/change_company_publicly_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag               = "3bb2da7aaf36e5729c4650baf175ef3b" -> "8438672d14add514dd36ef0f6acd9db0"
        id                 = "lambdas/demo/change_user_role_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag               = "65ac27e75ac4e7261107a069b038abb0" -> "6d761c3af833a24ec7763350a89c296e"
        id                 = "lambdas/demo/connect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag               = "918ce52f115e0fa20ce83d3836207c09" -> "90392e7e87be848ea479877735a567f9"
        id                 = "lambdas/demo/delete_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag               = "662c357a85af01a4379cf4811cb2e3c2" -> "72dd0e158c6a0c0255fa7bdf1b32ab84"
        id                 = "lambdas/demo/delete_scenarios_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_tags_function_object" {
      ~ etag               = "523b770bf07e08503e81c3f6087f2d13" -> "0280a50e21aa7f77343c2b039025b144"
        id                 = "lambdas/demo/delete_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag               = "68f88a9745e8ccb30b01b0862f56f9c8" -> "269b660b9d59b56b2d9fbfef089c10ba"
        id                 = "lambdas/demo/disconnect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag               = "0b059ca8536ea2b111978a90b4b2b174" -> "e7cb98da0a24ef43cad69567fc557fe0"
        id                 = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag               = "1f4320e070a8a3552f7839143541eea6" -> "15a14a7493f77f0767f27df19a13ea10"
        id                 = "lambdas/demo/edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag               = "4f09a0cd7e8c7f060e49f35daea9a1c7" -> "f229501dbafd2df4eccfbd20ac998730"
        id                 = "lambdas/demo/get_all_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag               = "f0e54b9bca3aae4576b7748be4118fba" -> "798412f477f6fdd4b349dd2e2f010ea4"
        id                 = "lambdas/demo/get_all_public_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_tags_function_object" {
      ~ etag               = "cd5ef6e0a70212640df3816710309106" -> "1180f3147f513d69c2a93755646cbfc5"
        id                 = "lambdas/demo/get_all_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag               = "e8c02a3806e3a7a38bc5c1b9245824fe" -> "2c0c17953a7eba8729734ae58ea7d9bd"
        id                 = "lambdas/demo/get_by_metric_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag               = "6f6404e590ca7329c291bbd7ca9c2e2e" -> "202e83945a4a9a3625c8636411201e59"
        id                 = "lambdas/demo/get_company_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag               = "aefe28017c94058c5306e7846eb5b85b" -> "3c9813831f2b7e1548fa0dd9f756f9a3"
        id                 = "lambdas/demo/get_company_investments_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag               = "183bd6c28c286b1a75581b42aff2efea" -> "e943a03fd1838bcbd59c42caa177feb9"
        id                 = "lambdas/demo/get_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag               = "3475c3b0460254e891944e4bd5d55d2d" -> "98b1f0e59d942f1bc0b31e2b9ad966bb"
        id                 = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag               = "a50652519174bd99ef07ce317e3e7aa8" -> "ed74f9ac93c0293a5c7898b291c0f2ba"
        id                 = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag               = "b7905316d2adcd45c87b61c9fcdc2308" -> "78869f29c504d808d9802c534309ad78"
        id                 = "lambdas/demo/get_dynamic_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag               = "9c75d1b2e3cc5dd7e76eb81ee20921a0" -> "d28fcb7342fe7c49393be0271c9e764c"
        id                 = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_date_report_function_object" {
      ~ etag               = "7f66e3ef6f41617d8712a3ddc21cada7" -> "9a5a6c948e31cbfd63291c648c04ebd0"
        id                 = "lambdas/demo/get_investment_date_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag               = "5b4f81992f27b3a31960aa618a2f3ecc" -> "50e49a6c92e75868fa89e77707cbc4a6"
        id                 = "lambdas/demo/get_metric_types_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag               = "2bc42e1871125963d734eac22fed0225" -> "4f22eb1dc684b7ef16dc703757c248ef"
        id                 = "lambdas/demo/get_roles_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_tags_by_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_tags_by_company_function_object" {
      ~ etag               = "4ad227eb3e74a85574d3b54699ac421c" -> "43bb21d07b8b089b27688d21ffb5740e"
        id                 = "lambdas/demo/get_tags_by_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag               = "fc00a560b243e84c99e609eacdc40677" -> "2ce67cbfbb10490491c140f2b1673427"
        id                 = "lambdas/demo/get_universe_overview_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag               = "42ca2fb692552bf2775aef3e54f1236c" -> "d98e5a01b151c2080d9c41db2f8e3657"
        id                 = "lambdas/demo/get_user_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag               = "c26f8703675c3928dd1ec38c411e852a" -> "2b8489d1b0147ab98fc9301d1427f0de"
        id                 = "lambdas/demo/get_users_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag               = "f0cf3cb7f2ef475fcb6f24a7ead92574" -> "cc3d244940a105e9497643839076d495"
        id                 = "lambdas/demo/glue_trigger_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag               = "1c5f3a44581789f39a86322b471f4bf5" -> "f89d946c4162b1be26d3b4294cc1aaf4"
        id                 = "layer/demo/layer_libraries.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag               = "02cd987236dcb82ad3132368a7ad922a" -> "f109d7476b66022ab4410abe1e62f07c"
        id                 = "lambdas/demo/message.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag               = "b0250ce808ed4e3417c67728e91a6135" -> "04830cbdb7830fd23f7feeb085bd33ad"
        id                 = "lambdas/demo/register.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag               = "9cf4711f41c324d42b88b55538569865" -> "1a9ddbd42c86bdacd6dd71a6ec49f8cb"
        id                 = "lambdas/demo/update_data.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_tags_function_object" {
      ~ etag               = "baf5556041fa35d121ff5d23df01a9e8" -> "5e46d5da018156b1474f00da529510b0"
        id                 = "lambdas/demo/update_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag               = "80deeff267036c7db43c2231f7ed0655" -> "8df99035f083247909b52266fc36d639"
        id                 = "lambdas/demo/upload_file_s3_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag               = "3227dc25a31564a1bf949811d978f518" -> "4e93e5cede8715a5eac91f41452d8900"
        id                 = "lambdas/demo/validate_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag               = "dbc043a7e7081aefb875a88dee8b9ea5" -> "25ddc96f2193e4cf260509c3f4a74a3c"
        id                 = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2022-10-17T19:17:20.000+0000" -> (known after apply)
      ~ source_code_hash               = "L0l9w/LUOnAPWeRWWpFGqYRSCM4x4ZbSFG2+sSGWfGE=" -> "lG2Ikf4uUzlV+H2vhKmusMM1Aad+cR5fUAshxjvM+aE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2022-10-17T19:16:49.000+0000" -> (known after apply)
      ~ source_code_hash               = "ouO1/siMWws+Tg/UVNTFy5pvkoNcBC1e47GJFAKpS/U=" -> "IXVuXS8ANdO7OuhrpOVH68JFHDuiyrBUcy8L0U8F/lE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_tag_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_tag_lambda_function" {
        id                             = "demo_add_tag_lambda_function"
      ~ last_modified                  = "2022-10-17T19:18:29.815+0000" -> (known after apply)
      ~ source_code_hash               = "9b3Aoay3AHTLFekjpOIQlYNPuHlqUUPMUjLrekgqUOM=" -> "Y8fJdgKRxpf19ZbAry1SsGg2KC6VaTvAEJ9wQKEbl8I="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2022-10-17T19:17:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "zJnuuxEd53dB+c02lrQzKbxxVV91bzbEh6SxTO3K6RM=" -> "K4GZSjJE5ePskHXKPNnl9n1iAiteK2GlHA7GUdYwYmY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2022-10-17T19:17:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "m5PqWZaAB/3Ipw8SJLO6ROAPky+twfdXXVXEXmgRrNk=" -> "BJeJfT8U2GG+LuFyb29z6wQxmYbJflgFI2e3+Kn8DNk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2022-10-17T19:16:49.000+0000" -> (known after apply)
      ~ source_code_hash               = "AXxEalKVwy/Lq2S3TEElM+Z8UE+3kIU9nEr8Hvb2fqU=" -> "aObKm03Czqqdo2rqXpxxtr+XscZzngJZfhJfzZ3Xd7I="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2022-10-17T19:18:18.000+0000" -> (known after apply)
      ~ source_code_hash               = "ueXTXYAcQZNfvoEm/kFTjCmdc8AoEEZszXhn7xlmWCM=" -> "S6HdQfn4n3nngnZIcIZMvv+4n4u7q87vV2a/y2WSdwg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2022-10-17T19:18:07.000+0000" -> (known after apply)
      ~ source_code_hash               = "EDu+4Xbfd16SVRTcGbd3erYMQbgN/mgikTP7H1OZz3w=" -> "kKbZaOkC9evT30tQ8hkgNrib2/gqtcX8KBTwppm7cNQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2022-10-17T19:18:08.000+0000" -> (known after apply)
      ~ source_code_hash               = "NRGIpMvuI2g/jHxC02dHKIpAQsOVa+ED8pTGerDI+o0=" -> "6A38znXMQcOj1d5VJ7q2x6P/mDaYCQX0ym4ZXN0Mzoc="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2022-10-17T19:17:22.000+0000" -> (known after apply)
      ~ source_code_hash               = "ZT17nljKBhsGiExXynfaZcOlwC+bBnd+/SVUqwY1v94=" -> "cUfVeLsJuHxtyUCW+yofRf1KEv4uDygYzukgdW1vpvE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2022-10-17T19:18:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "Iqq3YckCBN0WTAtINnlMSzmGtFvJjwvBG1BWzY5MePE=" -> "uzFRLfF2yoUm7knT+ewRT5eKjnZ0Y9H1/CU2jjmVjEU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_tags_lambda_function" {
        id                             = "demo_delete_tags_lambda_function"
      ~ last_modified                  = "2022-10-17T19:18:29.048+0000" -> (known after apply)
      ~ source_code_hash               = "s7zR0z9POPE/e6j63GBOZ1JNa/w4xZ/nQ8RGuHQ4LPs=" -> "BldZUipxIXxNyLVtL472kDksIV59x05h/WM2miIrPb8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2022-10-17T19:17:20.000+0000" -> (known after apply)
      ~ source_code_hash               = "Bhqb6ui6BcwO5wPIuNKjsOdGg4tTVY0v0j2ksFDDK5E=" -> "RfJhMVP+0iEK0UQs49wwYueoeZm9TopUQtf2Vzzc034="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-10-17T19:16:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "kbJTwmQpfn9OQ7v7xf6yMWPJtogJJ8huk6uLy1p0k6g=" -> "Dbhv8Bhz0UM05ZLbLavuSksE9uMAWMYDf2bEDXdtMxE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-10-17T19:16:50.000+0000" -> (known after apply)
      ~ source_code_hash               = "bBz9iKqFXZ5oGZfuctRZP+/DVQWYeaFjrgFSBsqVftU=" -> "M8AAqPcqgK0zth2cNhKFy9R/j/svd97SB1BjtOrYl6Y="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2022-10-17T19:17:36.000+0000" -> (known after apply)
      ~ source_code_hash               = "yfG18UnEa8Si3yD0RVGEUQmCVjAFg7JL5oayJrdszVE=" -> "/4HAinOKQFFOwHHNqUqLf1u8ydFDHIHv+Fp7aOgdF54="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2022-10-17T19:16:47.000+0000" -> (known after apply)
      ~ source_code_hash               = "Q+ATtGUM4Ycsp7xBbqMlRHnTarlV29hPLUWQx6wdywQ=" -> "R6kMhiL3QQ5ylDHHF6CyMg8XvamthFwz8dSpOc9fJcM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_tags_lambda_function" {
        id                             = "demo_get_all_tags_lambda_function"
      ~ last_modified                  = "2022-10-17T19:18:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "NEWix2wfCHWigp/rGPp6MzQ2xDQUBbT78NQr8KfEtOw=" -> "acLmEEsI67hCLUkB1gZfPML4STlje40wfRJeCO9XsLY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2022-10-17T19:18:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "AS++zzwQBkvk5Yj6qiEVa41By26MKRNb3+zkjzy4kw0=" -> "yHkouBKNdf035o/DzfLQqb1tx1FAlOlzb3zffnpjOsc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2022-10-17T19:18:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "m6HPI0pYQ3CGOsvKL23013faUx0I7EcAYVjWvuY4IxM=" -> "tHk96PjzZfi7JnxYzCe3mN9TMOPlCyRaZZ+OszCck1s="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2022-10-17T19:16:50.000+0000" -> (known after apply)
      ~ source_code_hash               = "RRwQXcrQNgZ3Jv3Ylaa7OOoimSEplV+p1oSzjNNryH8=" -> "TUvwKsYtyEyRRMjnO9mK8GKjHlB6o4lAWQ4NSulQl08="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2022-10-17T19:17:42.000+0000" -> (known after apply)
      ~ source_code_hash               = "2ROWm3jLGrAeB4xiiwfnewdjPxgghOyYL9AwaaNCpq8=" -> "wN+EU6qDp+axL96EP8u1LjPvWkMlEdJsxYZ+9m4Tycc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2022-10-17T19:18:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "wKepvwT6jx+NoQaT7az9pkS66R62lPlK1ls7KFoQ86s=" -> "bUP1XZCD6RhTc14F7R7jdH5Z6YUwvPDE3EA8Elge3I0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-10-17T19:18:18.000+0000" -> (known after apply)
      ~ source_code_hash               = "iXwcJx1xH58F2KKBFhrWAfCa36T/zQaUanSbHXtLtbc=" -> "d+wRSlNv2LFS8AUaMS8ttyu0Z/vqdOpGWz/6336yR2s="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2022-10-17T19:18:20.000+0000" -> (known after apply)
      ~ source_code_hash               = "1va9PXdpF2E58ZQs1/NkF7LO/5ErXlqA3EAVrjqaoC4=" -> "wE0MKxq0FoVoMVEmHRBBI2G5v+AlVk+ykJ3w6p54I3A="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-10-17T19:17:20.000+0000" -> (known after apply)
      ~ source_code_hash               = "VOC80MSGwSZKu90RT5+fRGWKOmlWMvHlGapRkhH0kq8=" -> "oWC/KVLz2HmpUWyTx7dURqJOhsmwObZifApfeuXC7xc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_date_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_date_report_lambda_function" {
        id                             = "demo_get_investment_date_report_lambda_function"
      ~ last_modified                  = "2022-10-17T19:18:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "xfq8hNaBTvHxwpjno1kUX/dghIzLSU7OAVm/EYxU2H4=" -> "fQAysY6Sd8wiQplgdhhwoxy6V8UHlL6AT8jPrtF5Lbo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2022-10-17T19:16:49.000+0000" -> (known after apply)
      ~ source_code_hash               = "yDbtUTMXcav1JJqHsKNV7N2byCXIX9A/hs47cD7pqvU=" -> "j+FxJqNudJ+RIzDf5QgpWnbpu3SjMt3i3+Av8Bvgc+I="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2022-10-17T19:17:44.000+0000" -> (known after apply)
      ~ source_code_hash               = "ct8Vvxdpr5Mm1v+3X0qCLmj0QJAQJwnH3H2JENv1S9g=" -> "OjfWyoSgUQXVZmNdqM+N1O0ASc6Nj3lebkU2QH7U8EU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_tags_by_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_tags_by_company_lambda_function" {
        id                             = "demo_get_tags_by_company_lambda_function"
      ~ last_modified                  = "2022-10-19T15:40:51.000+0000" -> (known after apply)
      ~ source_code_hash               = "n74A2nSqUnbScU2OG0plV3z2LBL51s7P40/6RnPKhQ4=" -> "BAFMu/h4944b4K4/jQqdSxvilhG0At916FhjfDz4SfI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2022-10-17T19:16:49.000+0000" -> (known after apply)
      ~ source_code_hash               = "y9CAh/eiSIb/4eBz5rwF1eWLhB1ul1Eftv65+IsK7mA=" -> "rYR5NENPLmL9INoPpTtU+PNlkQrulC/A79ALvrunrBc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2022-10-17T19:17:20.000+0000" -> (known after apply)
      ~ source_code_hash               = "nmgbEClnpQn/8CBpIlvglCfU/JCMtDxpRA9F+1tX3cs=" -> "XJ5w5JR84zMGRWVz2zH/re+VQdvhtKaXN0mtpU6zJq8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2022-10-17T19:18:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "UnAykZq0oRSsaGuNp/DZAa1Juu48M77k1tvyjlStUF8=" -> "ouEG/pxi7cOZ0z9tbfCsddc5FZugOwLcjCnjwkzV2Do="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2022-10-17T19:18:18.000+0000" -> (known after apply)
      ~ source_code_hash               = "TII9KzTL8kfjQR5CsuEKJmtjTi1AbB0NFdOdeE3E2ro=" -> "SOtzK5UsqJ+2mQm2W7K6G9eGz9V/5FOUmeXLUe+WVA4="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2022-10-17T19:18:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "6vBYkANzSSZEHvwiB8r/0NS6gzPuM86Ak82CDbYg9Fs=" -> "WmmLup6b1bkbJRCP3yItdpfLlWuZPuP/B43qebUwX/Y="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2022-10-17T19:18:35.000+0000" -> (known after apply)
      ~ source_code_hash               = "OQBGmlhxzLK9d1hMB76DGXN8MYWFCwVqed1M1INrKvQ=" -> "4Sy9AzoDKKYTr4QMYSh0FmU2RejpT7aBgstQxu8vffM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2022-10-17T19:17:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "kBP0/pruva19T7CVoJttksFOnGdD9EKDj8M1owir46U=" -> "6nd2bff2Mq7f8xwMTiS7prU1+FAH2FvvgO+UTkUO3+E="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_tags_lambda_function" {
        id                             = "demo_update_tags_lambda_function"
      ~ last_modified                  = "2022-10-17T19:18:29.815+0000" -> (known after apply)
      ~ source_code_hash               = "qTTqw2sRQ53+Jn9C5+RTpJYm4xyDn8j364P3yzX3Wt0=" -> "xj00Nyfxq86sXuzTCS0ScVCrQ8S1TcpIaXCbxen/Kxw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2022-10-17T19:17:41.000+0000" -> (known after apply)
      ~ source_code_hash               = "2AvEjneqTOWEZjdhnp8s8y4Gn7WgFRCVzKTHPspueug=" -> "zNgpwArWJzR4N0+2XvaGYwAxl9F4+gP5IjchPi4cM3s="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2022-10-17T19:17:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "40zNJzZ19czzxc2OcYcLce7+ardm5BsZBRW36VuBKPY=" -> "BBLNbxmnRTyHO6uHeuCPbxZMO02SvPB/JoHZ/ssWiec="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2022-10-17T19:18:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "PWLIdkSRaYfWnrxkwDyZYeIlYMw5A04KnfQgaFKS0HE=" -> "8k9mRpRdQ8YQjvIY7bCAN3S/P+ApYRb+TAyvS7nvwf4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2022-10-17T19:16:40Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "pgdiga" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2022-10-17T19:16:39Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2022-10-17T19:16:39Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
                  - status       = "$context.status"
                  - user         = "$context.identity.user"
                }
            ) -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 85 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @dsgarcia8, Action: `pull_request`*